# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 1  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
#  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
#   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
#   [-1, 3, C3, [128]],
#   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
#   [-1, 6, C3, [256]],
#   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
#   [-1, 9, C3, [512]],
#   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
#   [-1, 3, C3, [1024]],
#   [-1, 1, SPPF, [1024, 5]],  # 9
#  ]
  [[-1, 1, conv_bn_hswish, [16, 2]],                 # 0-p1/2
   [-1, 1, MobileNet_Block, [16,  16, 3, 2, 1, 0]],  # 1-p2/4
   [-1, 1, MobileNet_Block, [24,  72, 3, 2, 0, 0]],  # 2-p3/8
   [-1, 1, MobileNet_Block, [24,  88, 3, 1, 0, 0]],  # 3-p3/8
   [-1, 1, MobileNet_Block, [40,  96, 5, 2, 1, 1]],  # 4-p4/16
   [-1, 1, MobileNet_Block, [40, 240, 5, 1, 1, 1]],  # 5-p4/16
   [-1, 1, MobileNet_Block, [40, 240, 5, 1, 1, 1]],  # 6-p4/16
   [-1, 1, MobileNet_Block, [48, 120, 5, 1, 1, 1]],  # 7-p4/16
   [-1, 1, MobileNet_Block, [48, 144, 5, 1, 1, 1]],  # 8-p4/16
   [-1, 1, MobileNet_Block, [96, 288, 5, 2, 1, 1]],  # 9-p5/32
   [-1, 1, MobileNet_Block, [96, 576, 5, 1, 1, 1]],  # 10-p5/32
   [-1, 1, MobileNet_Block, [96, 576, 5, 1, 1, 1]],  # 11-p5/32
   [-1, 1, SPPF, [1024, 5]],#12
  ]
# YOLOv5 v6.0 BiFPN head
head:
  [[-1, 1, Conv, [512, 1, 1]],#13
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],#14
   [[-1, 8], 1, BiFPN_Concat2, [1]],  #15 cat backbone P4 <--- BiFPN change
   [-1, 3, C3, [512, False]],  # 16

   [-1, 1, Conv, [256, 1, 1]],#17
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],#18
   [[-1, 3], 1, BiFPN_Concat2, [1]],  #19 cat backbone P3 <--- BiFPN change
   [-1, 3, C3, [256, False]],  # 20 (P3/8-small)
   [-1, 1, ECA, [256]],#21

   [-1, 1, Conv, [256, 3, 2]],#22
   [[-1, 17, 8], 1, BiFPN_Concat3, [1]],  #23 cat P4 <--- BiFPN change
   [-1, 3, C3, [512, False]],  # 24 (P4/16-medium)
   [-1, 1, ECA, [512]],#25

   [-1, 1, Conv, [512, 3, 2]],#26
   [[-1, 13], 1, BiFPN_Concat2, [1]],  #27 cat head P5 <--- BiFPN change
   [-1, 3, C3, [1024, False]],  # 28 (P5/32-large)
   [-1, 1, ECA, [1024]],#29

   [[20, 24, 29], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
#activate pytorch1
#cd C:\Users\17237\Desktop\yolov5-master\yolov5-me       cd C:\Users\aaa\Desktop\yolov5-master\yolov5-me
#python train.py --cfg yolov5s-Bifpn-mobileNet-ECA.yaml --project runs/train/yolov5s-mobileNet-ECA-Bifpn